src/cf/src/InformationRegisters/КураторыДоговоров/КураторыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КураторыДоговоров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/InformationRegisters/ЦеныЗакупки/ЦеныЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныЗакупки</name>
  <comment>Фиксированные цены по контрагенту; запись с пустым контрагентом - цена по умолчанию</comment>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныПродажи/ЦеныПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажи</name>
  <comment>Фиксированные цены по контрагенту; запись с пустым контрагентом - цена по умолчанию</comment>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЕдиницыХранения</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураКонтрагента</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыНаценок/ВидыНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНаценок</name>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Процент</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Кассы/Кассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кассы</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтозакрытиеСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакрытияСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/ОбщегоНазначенияВызовСервера/Module.bsl
#Область Справочники

Функция ПолучитьДанныеОрганизации(Организация) Экспорт	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	БанковскиеСчета.Владелец КАК Организация,
	                      |	БанковскиеСчета.Ссылка КАК БанковскийСчёт
	                      |ПОМЕСТИТЬ ВТБанковскиеСчета
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		БанковскиеСчета.Владелец КАК Владелец,
	                      |		МАКСИМУМ(БанковскиеСчета.Основной) КАК Основной
	                      |	ИЗ
	                      |		Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |	ГДЕ
	                      |		БанковскиеСчета.Владелец = &Организация
	                      |		И НЕ БанковскиеСчета.ПометкаУдаления
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		БанковскиеСчета.Владелец) КАК ВЗ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |		ПО ВЗ.Владелец = БанковскиеСчета.Владелец
	                      |			И ВЗ.Основной = БанковскиеСчета.Основной
	                      |			И (НЕ БанковскиеСчета.ПометкаУдаления)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Кассы.Владелец КАК Организация,
	                      |	Кассы.Ссылка КАК Касса
	                      |ПОМЕСТИТЬ ВТКассы
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Кассы.Владелец КАК Владелец,
	                      |		МАКСИМУМ(Кассы.Основная) КАК Основная
	                      |	ИЗ
	                      |		Справочник.Кассы КАК Кассы
	                      |	ГДЕ
	                      |		Кассы.Владелец = &Организация
	                      |		И НЕ Кассы.ПометкаУдаления
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		Кассы.Владелец) КАК ВЗ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	                      |		ПО ВЗ.Владелец = Кассы.Владелец
	                      |			И ВЗ.Основная = Кассы.Основная
	                      |			И (НЕ Кассы.ПометкаУдаления)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Организации.Ссылка КАК Организация,
	                      |	ЕСТЬNULL(ВТБанковскиеСчета.БанковскийСчёт, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) КАК БанковскийСчёт,
	                      |	ЕСТЬNULL(ВТКассы.Касса, ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)) КАК Касса
	                      |ИЗ
	                      |	Справочник.Организации КАК Организации
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБанковскиеСчета КАК ВТБанковскиеСчета
	                      |		ПО Организации.Ссылка = ВТБанковскиеСчета.Организация
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКассы КАК ВТКассы
	                      |		ПО Организации.Ссылка = ВТКассы.Организация
	                      |ГДЕ
	                      |	Организации.Ссылка = &Организация");
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Новый Структура("БанковскийСчёт, Касса");
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выб);	
	КонецЕсли;	
	Возврат Результат;
КонецФункции	

Функция ПолучитьДанныеКонтрагента(Контрагент, Организация, ВидДоговора, ДатаСреза) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫБОР
	                      |		КОГДА Контрагенты.Родитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |			ТОГДА Контрагенты.Ссылка
	                      |		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ОбособленноеПодразделение)
	                      |			ТОГДА Контрагенты.Родитель
	                      |		ИНАЧЕ Контрагенты.Ссылка
	                      |	КОНЕЦ КАК Контрагент
	                      |ПОМЕСТИТЬ ВТКонтрагент
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |ГДЕ
	                      |	Контрагенты.Ссылка = &Контрагент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТКонтрагент.Контрагент КАК Контрагент,
	                      |	ЕСТЬNULL(БанковскиеСчета.Ссылка, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) КАК БанковскийСчёт,
	                      |	ЕСТЬNULL(БанковскиеСчета.Основной, ЛОЖЬ) КАК Основной
	                      |ПОМЕСТИТЬ ВТБанковскиеСчетаВсе
	                      |ИЗ
	                      |	ВТКонтрагент КАК ВТКонтрагент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	                      |		ПО ВТКонтрагент.Контрагент = БанковскиеСчета.Владелец
	                      |			И (НЕ БанковскиеСчета.ПометкаУдаления)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ВТБанковскиеСчетаВсе.Контрагент КАК Контрагент,
	                      |	ВТБанковскиеСчетаВсе.БанковскийСчёт КАК БанковскийСчёт
	                      |ПОМЕСТИТЬ ВТБанковскиеСчета
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТБанковскиеСчетаВсе.Контрагент КАК Контрагент,
	                      |		МАКСИМУМ(ВТБанковскиеСчетаВсе.Основной) КАК Основной
	                      |	ИЗ
	                      |		ВТБанковскиеСчетаВсе КАК ВТБанковскиеСчетаВсе
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТБанковскиеСчетаВсе.Контрагент) КАК ВЗ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБанковскиеСчетаВсе КАК ВТБанковскиеСчетаВсе
	                      |		ПО ВЗ.Контрагент = ВТБанковскиеСчетаВсе.Контрагент
	                      |			И ВЗ.Основной = ВТБанковскиеСчетаВсе.Основной
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТКонтрагент.Контрагент КАК Контрагент,
	                      |	ЕСТЬNULL(ДоговорыСКонтрагентами.Ссылка, ЗНАЧЕНИЕ(Справочник.ДоговорыСКонтрагентами.ПУстаяСсылка)) КАК Договор,
	                      |	ЕСТЬNULL(ДоговорыСКонтрагентами.Основной, ЛОЖЬ) КАК Основной
	                      |ПОМЕСТИТЬ ВТДоговорыСКонтрагентамиВсе
	                      |ИЗ
	                      |	ВТКонтрагент КАК ВТКонтрагент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыСКонтрагентами КАК ДоговорыСКонтрагентами
	                      |		ПО ВТКонтрагент.Контрагент = ДоговорыСКонтрагентами.Контрагент
	                      |			И (ДоговорыСКонтрагентами.Организация = &Организация)
	                      |			И (НЕ ДоговорыСКонтрагентами.ПометкаУдаления)
	                      |			И (ДоговорыСКонтрагентами.ВидДоговора = &ВидДоговора)
	                      |			И (ДоговорыСКонтрагентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует))
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ВТДоговорыСКонтрагентамиВсе.Контрагент КАК Контрагент,
	                      |	ВТДоговорыСКонтрагентамиВсе.Договор КАК Договор,
	                      |	ЕСТЬNULL(КураторыДоговоровСрезПоследних.Куратор, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Менеджер
	                      |ПОМЕСТИТЬ ВТДоговорыСКонтрагентами
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТДоговорыСКонтрагентамиВсе.Контрагент КАК Контрагент,
	                      |		МАКСИМУМ(ВТДоговорыСКонтрагентамиВсе.Основной) КАК Основной
	                      |	ИЗ
	                      |		ВТДоговорыСКонтрагентамиВсе КАК ВТДоговорыСКонтрагентамиВсе
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТДоговорыСКонтрагентамиВсе.Контрагент) КАК ВЗ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговорыСКонтрагентамиВсе КАК ВТДоговорыСКонтрагентамиВсе
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КураторыДоговоров.СрезПоследних(&ДатаСреза, ) КАК КураторыДоговоровСрезПоследних
	                      |			ПО ВТДоговорыСКонтрагентамиВсе.Договор = КураторыДоговоровСрезПоследних.Договор
	                      |		ПО ВЗ.Контрагент = ВТДоговорыСКонтрагентамиВсе.Контрагент
	                      |			И ВЗ.Основной = ВТДоговорыСКонтрагентамиВсе.Основной
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТКонтрагент.Контрагент КАК Контрагент,
	                      |	ВТБанковскиеСчета.БанковскийСчёт КАК БанковскийСчёт,
	                      |	ВТДоговорыСКонтрагентами.Договор КАК Договор,
	                      |	ВЫБОР
	                      |		КОГДА ВТКонтрагент.Контрагент.ТипЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	                      |			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.Розничная)
	                      |		ИНАЧЕ ВТКонтрагент.Контрагент.ТипЦены
	                      |	КОНЕЦ КАК ВидЦены,
	                      |	ВТДоговорыСКонтрагентами.Менеджер КАК Менеджер,
	                      |	ВЫБОР
	                      |		КОГДА ВТКонтрагент.Контрагент.ТипЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ВТКонтрагент.Контрагент.ТипЦены.ЦенаВключаетНДС
	                      |	КОНЕЦ КАК ЦенаВключаетНДС
	                      |ИЗ
	                      |	ВТКонтрагент КАК ВТКонтрагент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБанковскиеСчета КАК ВТБанковскиеСчета
	                      |		ПО ВТКонтрагент.Контрагент = ВТБанковскиеСчета.Контрагент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговорыСКонтрагентами КАК ВТДоговорыСКонтрагентами
	                      |		ПО ВТКонтрагент.Контрагент = ВТДоговорыСКонтрагентами.Контрагент");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Результат = Новый Структура("Контрагент, Договор, БанковскийСчёт, Менеджер, ВидЦены, ЦенаВключаетНДС");
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выб);	
	КонецЕсли;	
	Возврат Результат;
КонецФункции

Функция ПолучитьОсновнойДоговор(Контрагент, Организация, Покупатель) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорыСКонтрагентами.Ссылка КАК Ссылка,
	                      |	ДоговорыСКонтрагентами.Основной КАК Основной
	                      |ИЗ
	                      |	Справочник.ДоговорыСКонтрагентами КАК ДоговорыСКонтрагентами
	                      |ГДЕ
	                      |	ДоговорыСКонтрагентами.Контрагент = &Контрагент
	                      |	И ДоговорыСКонтрагентами.Организация = &Организация
	                      |	И ВЫБОР
	                      |			КОГДА &Покупатель = ИСТИНА
	                      |				ТОГДА ДоговорыСКонтрагентами.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СПокупателем)
	                      |			ИНАЧЕ ДоговорыСКонтрагентами.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СПоставщиком)
	                      |		КОНЕЦ
	                      |	И НЕ ДоговорыСКонтрагентами.ПометкаУдаления
	                      |	И ДоговорыСКонтрагентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Основной УБЫВ");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Покупатель", Покупатель);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.ДоговорыСКонтрагентами.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции

// Заполняет в структуре строки документа реквизиты номенклатуры, цену и остаток.
//
// Параметры:
//  Стр - Структура - строка документа (см. РаботаСДокументамиКлиентСервер.ПреобразоватьСтрокуТаблицыВСтруктуру);
//        заполняются только имеющиеся свойства: СтавкаНДС, ТоварнаяГруппа, Единица, Упаковка, Цена, Остаток.
//  БезЦен - Булево - Истина: цену не получать.
//  ЦенаВключаетНДС - Булево - признак цены с НДС для расчёта цены.
//  ПолучитьОстаток - Булево - Истина: при наличии свойства Остаток заполнить его остатком по складу
//                    из свойства МестоХранения (пустой: склад пользователя).
//
Процедура ПолучитьДанныеНоменклатуры(Стр, БезЦен = Ложь, ЦенаВключаетНДС = Истина, ПолучитьОстаток = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЕстьСтавкаНДС = Стр.Свойство("СтавкаНДС");
	ЕстьТоварнаяГруппа = Стр.Свойство("ТоварнаяГруппа");
	ЕстьЦена = Стр.Свойство("Цена");
	ЕстьЕдиница = Стр.Свойство("Единица");
	ЕстьУпаковка = Стр.Свойство("Упаковка");
	//
	//Если ЕстьСтавкаНДС Или ЕстьТоварнаяГруппа Тогда	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Спр.Ссылка КАК Номенклатура,
		                      |	Спр.СтавкаНДС КАК СтавкаНДС,
		                      |	Спр.ТоварнаяГруппа КАК ТоварнаяГруппа,
		                      |	Спр.Единица КАК Единица
		                      |ИЗ
		                      |	Справочник.Номенклатура КАК Спр
		                      |ГДЕ
		                      |	Спр.Ссылка = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
		Выб = Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда	
			Если ЕстьСтавкаНДС Тогда
				Стр.СтавкаНДС = Выб.СтавкаНДС;
			КонецЕсли;
			Если ЕстьТоварнаяГруппа Тогда
				Стр.ТоварнаяГруппа = Выб.ТоварнаяГруппа;
			КонецЕсли;
			Если ЕстьЕдиница Тогда
				Стр.Единица = Выб.Единица;
			КонецЕсли;
			Если ЕстьУпаковка Тогда
				Стр.Упаковка = Выб.Единица;
			КонецЕсли;
		КонецЕсли;
	//КонецЕсли;
	Если ЕстьЦена и Не БезЦен Тогда
		ПолучитьЦенуНоменклатуры(Стр, ,ЦенаВключаетНДС);
	КонецЕсли;
	Если ПолучитьОстаток И Стр.Свойство("Остаток") Тогда
		ЗаполнитьОстатокСтроки(Стр);
	КонецЕсли;
КонецПроцедуры

// Заполняет свойство Остаток строки остатком по складу строки или, если он не указан, по складу пользователя.
//
// Параметры:
//  Стр - Структура - строка документа со свойствами Номенклатура, Остаток и, возможно,
//        МестоХранения и Характеристика.
//
Процедура ЗаполнитьОстатокСтроки(Стр)
	МестоХранения = ?(Стр.Свойство("МестоХранения"), Стр.МестоХранения, Неопределено);
	Если Не ЗначениеЗаполнено(МестоХранения) Тогда
		МестоХранения = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	КонецЕсли;
	Характеристика = ?(Стр.Свойство("Характеристика"), Стр.Характеристика, Неопределено);
	Стр.Остаток = РегистрыНакопления.ТоварыВНаличии.ПолучитьОстатокПоТовару(МестоХранения, Стр.Номенклатура, Характеристика);
КонецПроцедуры

Процедура ПолучитьДанныеНоменклатурыКонтрагента(Стр, Знач ТЗЦены = Неопределено) Экспорт
	НоменклатураКонтрагента = Стр.НоменклатураКонтрагента; 
	Стр.Номенклатура = НоменклатураКонтрагента.Номенклатура;
	Стр.Характеристика = НоменклатураКонтрагента.Характеристика;
	Стр.Упаковка = НоменклатураКонтрагента.Упаковка;
КонецПроцедуры

// Подставляет в строку документа цену: фиксированная цена контрагента (регистры ЦеныЗакупки/ЦеныПродажи),
// иначе прайс (для покупателей - по виду цен, с динамическим расчётом от последнего прихода или
// себестоимости; для поставщиков - последний прайс поставщика). Цена приводится к режиму НДС документа.
//
// Параметры:
//  Стр - Структура - строка документа (см. ПреобразоватьСтрокуТаблицыВСтруктуру): Номенклатура, Характеристика,
//        Упаковка, СтавкаНДС, Цена и, возможно, ВидЦены, Поставщик, Контрагент, ДатаЦены, ЦенаSKU,
//        ЦенаРозничная, ЦенаМинимальная, ЦенаПоТипуЦен.
//  ТЗПоследнийПрайс - ТаблицаЗначений, Неопределено - готовый срез цен (см. ЦеныНоменклатуры.ПоследнийПрайс).
//  ЦенаВключаетНДС - Булево - режим цен документа.
//  ДанныеЦен - Структура, Неопределено - заготовленные данные для табличной части (см. ДанныеЦенДляСписка):
//        Фиксированные, ПоследнийПриход, Себестоимость.
//
Процедура ПолучитьЦенуНоменклатуры(Стр, Знач ТЗПоследнийПрайс = Неопределено, ЦенаВключаетНДС = Истина,
	Знач ДанныеЦен = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЦенаПрайсаСНДС = Истина;
	// Получаем данные
	Если Стр.Свойство("Поставщик") Тогда // Поставщики	
		МасЦены = ЦеныДляЗакупки(Стр, ДанныеЦен, ЦенаПрайсаСНДС);
	ИначеЕсли Стр.Свойство("ВидЦены") и Не ЗначениеЗаполнено(Стр.ВидЦены) Тогда // Покупатели (Нет вида цен - "Произвольная")
		МасЦены = Новый Массив;	
	Иначе // Покупатели (Есть вид цен)	
		МасЦены = ЦеныДляПродажи(Стр, ТЗПоследнийПрайс, ДанныеЦен, ЦенаПрайсаСНДС);
	КонецЕсли;
	// Устанавливаем данные
	Если МасЦены.Количество() = 0 Тогда  
		Если Стр.Свойство("ВидЦены") Тогда
			Стр.ВидЦены = Неопределено;
		КонецЕсли;
		Стр.Цена = 0;
		Если Стр.Свойство("ЦенаSKU") Тогда
			Стр.ЦенаSKU = 0;	
		КонецЕсли;		
	Иначе	
		МасСтр = МасЦены[0];
		Если Стр.Свойство("ЦенаSKU") Тогда
			Если ЗначениеЗаполнено(МасСтр.Упаковка) Тогда // Цену устанавливали за упаковку, пересчитываем в основную единицу
				Стр.ЦенаSKU = МасСтр.Цена * РассчитатьКоэффициентЕдиницы(Стр.Номенклатура.Единица) / РассчитатьКоэффициентЕдиницы(МасСтр.Упаковка);	
			Иначе // Цену устанавливали за основную единицу	
				Стр.ЦенаSKU = МасСтр.Цена;
			КонецЕсли;
			Стр.ЦенаSKU = ПривестиЦенуКРежимуНДС(Стр.ЦенаSKU, Стр.СтавкаНДС, ЦенаПрайсаСНДС, ЦенаВключаетНДС);
		КонецЕсли; 	
		Если МасСтр.Упаковка = Стр.Упаковка Тогда
			Стр.Цена = МасСтр.Цена;
		Иначе	
			Стр.Цена = МасСтр.Цена * РассчитатьКоэффициентЕдиницы(Стр.Упаковка) / РассчитатьКоэффициентЕдиницы(МасСтр.Упаковка);	
		КонецЕсли;
		Стр.Цена = ПривестиЦенуКРежимуНДС(Стр.Цена, Стр.СтавкаНДС, ЦенаПрайсаСНДС, ЦенаВключаетНДС);
		ЗаполнитьСправочныеЦены(Стр, ДанныеЦен);
	КонецЕсли;
КонецПроцедуры

// Данные цен для подстановки в табличную часть одним запросом на список номенклатуры.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - контрагент документа (покупатель или поставщик).
//  ЭтоЗакупка - Булево - Истина: цены закупки, Ложь: цены продажи.
//  МасНоменклатура - Массив - номенклатура табличной части.
//  МасХарактеристики - Массив - характеристики табличной части.
//  ВидЦены - СправочникСсылка.ВидыЦен - вид цен документа (для динамического расчёта).
//  ДатаЦен - Дата - дата среза.
//
// Возвращаемое значение:
//  Структура - Фиксированные, ПоследнийПриход, Себестоимость (ТаблицаЗначений или Неопределено).
//
Функция ДанныеЦенДляСписка(Контрагент, ЭтоЗакупка, МасНоменклатура, МасХарактеристики, ВидЦены, ДатаЦен) Экспорт
	Результат = Новый Структура("Фиксированные, ПоследнийПриход, Себестоимость");
	Если ЭтоЗакупка Тогда
		Результат.Фиксированные = РегистрыСведений.ЦеныЗакупки.ПрайсПоставщика(Контрагент, МасНоменклатура);
		Возврат Результат;
	КонецЕсли;
	Результат.Фиксированные = РегистрыСведений.ЦеныПродажи.ПрайсПокупателя(Контрагент, МасНоменклатура);
	// Базы готовятся и для справочных цен строк (розничная, минимальная),
	// если их виды переведены на динамический расчёт.
	МасВиды = Новый Массив;
	МасВиды.Добавить(ВидЦены);
	МасВиды.Добавить(Справочники.ВидыЦен.Розничная);
	МасВиды.Добавить(Справочники.ВидыЦен.МинимальнаяЦенаПродажи);
	НуженПоследнийПриход = Ложь;
	НужнаСебестоимость = Ложь;
	Для Каждого Вид Из МасВиды Цикл
		ДанныеВида = ОбщегоНазначенияВызовСервераПовтИсп.ДанныеВидаЦены(Вид);
		Если Не ДанныеВида.ДинамическийРасчет Тогда
			Продолжить;
		КонецЕсли;
		Если ДанныеВида.ОсноваРасчёта = Перечисления.ОсновыРасчётаНаценок.ПоследнийПриход Тогда
			НуженПоследнийПриход = Истина;
		Иначе
			НужнаСебестоимость = Истина;
		КонецЕсли;
	КонецЦикла;
	Если НуженПоследнийПриход Тогда
		Результат.ПоследнийПриход = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ДатаЦен, МасНоменклатура);
	КонецЕсли;
	Если НужнаСебестоимость Тогда
		Результат.Себестоимость = РегистрыНакопления.ТоварыВНаличии.ПолучитьСреднююЦенуПоОстаткам(МасНоменклатура,
			МасХарактеристики, ДатаЦен);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Цены для строки документа закупки: фиксированная цена поставщика, иначе последний прайс.
//
// Параметры:
//  Стр - Структура - строка документа (см. ПреобразоватьСтрокуТаблицыВСтруктуру).
//  ДанныеЦен - Структура, Неопределено - заготовленные данные (см. ДанныеЦенДляСписка).
//  ЦенаПрайсаСНДС - Булево - возврат: режим НДС найденной цены.
//
// Возвращаемое значение:
//  Массив, ТаблицаЗначений - строки с ценами (первая используется).
//
Функция ЦеныДляЗакупки(Стр, ДанныеЦен, ЦенаПрайсаСНДС)
	Если ДанныеЦен = Неопределено Тогда
		МасЦены = РегистрыСведений.ЦеныЗакупки.ПрайсПоставщика(Стр.Поставщик, Стр.Номенклатура);
	Иначе
		МасЦены = ДанныеЦен.Фиксированные.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
	КонецЕсли;
	Если МасЦены.Количество() > 0 Тогда
		ЦенаПрайсаСНДС = МасЦены[0].ЦенаВключаетНДС;
		Возврат МасЦены;
	КонецЕсли;
	МасЦены = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(Стр.ДатаЦены, Стр.Номенклатура, Стр.Поставщик);
	Если МасЦены.Количество() = 0 Тогда 
		МасЦены = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(Стр.ДатаЦены, Стр.Номенклатура, Неопределено);
	КонецЕсли;
	Возврат МасЦены;
КонецФункции

// Цены для строки документа продажи: фиксированная цена покупателя, затем вид цен документа
// (динамический расчёт или прайс), затем розничная цена.
//
// Параметры:
//  Стр - Структура - строка документа (см. ПреобразоватьСтрокуТаблицыВСтруктуру).
//  ТЗПоследнийПрайс - ТаблицаЗначений, Неопределено - готовый срез прайса.
//  ДанныеЦен - Структура, Неопределено - заготовленные данные (см. ДанныеЦенДляСписка).
//  ЦенаПрайсаСНДС - Булево - возврат: режим НДС найденной цены.
//
// Возвращаемое значение:
//  Массив, ТаблицаЗначений - строки с ценами (первая используется).
//
Функция ЦеныДляПродажи(Стр, ТЗПоследнийПрайс, ДанныеЦен, ЦенаПрайсаСНДС)
	ВидЦеныРозничная = Справочники.ВидыЦен.Розничная;
	ВидЦены = ?(Стр.Свойство("ВидЦены"), Стр.ВидЦены, ВидЦеныРозничная);
	// Фиксированная цена покупателя
	Если ДанныеЦен <> Неопределено Тогда
		МасЦены = ДанныеЦен.Фиксированные.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
	ИначеЕсли Стр.Свойство("Контрагент") И ЗначениеЗаполнено(Стр.Контрагент) Тогда
		МасЦены = РегистрыСведений.ЦеныПродажи.ПрайсПокупателя(Стр.Контрагент, Стр.Номенклатура);
	Иначе
		МасЦены = Новый Массив;
	КонецЕсли;
	Если МасЦены.Количество() > 0 Тогда
		ЦенаПрайсаСНДС = МасЦены[0].ЦенаВключаетНДС;
		Возврат МасЦены;
	КонецЕсли;
	// Вид цен документа
	ДанныеВида = ОбщегоНазначенияВызовСервераПовтИсп.ДанныеВидаЦены(ВидЦены);
	Если ДанныеВида.ДинамическийРасчет Тогда
		ЦенаПрайсаСНДС = ДанныеВида.ЦенаВключаетНДС;
		Возврат ДинамическаяЦена(Стр, ДанныеВида, ДанныеЦен);
	КонецЕсли;
	Если ТЗПоследнийПрайс = Неопределено Тогда
		ДатаЦен = ?(Стр.Свойство("ДатаЦены"), Стр.ДатаЦены, ТекущаяДатаСеанса());
		МасВидыЦен = Новый Массив;
		МасВидыЦен.Добавить(ВидЦеныРозничная);
		МасВидыЦен.Добавить(ВидЦены);
		ТЗПоследнийПрайс = РегистрыСведений.ЦеныНоменклатуры.ПоследнийПрайс(ДатаЦен, МасВидыЦен, Стр.Номенклатура);
	КонецЕсли;
	Отбор = Новый Структура("Номенклатура, Характеристика, ВидЦены", Стр.Номенклатура, Стр.Характеристика, ВидЦены);
	МасЦены = ТЗПоследнийПрайс.НайтиСтроки(Отбор);
	Если МасЦены.Количество() = 0 Тогда
		Отбор.ВидЦены = ВидЦеныРозничная;
		МасЦены = ТЗПоследнийПрайс.НайтиСтроки(Отбор);
	КонецЕсли;
	Если МасЦены.Количество() > 0 Тогда
		ЦенаПрайсаСНДС = МасЦены[0].ЦенаВключаетНДС;
		Если Стр.Свойство("ВидЦены") Тогда
			Стр.ВидЦены = МасЦены[0].ВидЦены;
		КонецЕсли;
	КонецЕсли;
	Возврат МасЦены;
КонецФункции

// Динамическая цена вида цен: база (последний приход или средняя себестоимость, обе с НДС) приводится
// к режиму НДС вида цен, к ней применяется наценка вида и округление по точности.
//
// Параметры:
//  Стр - Структура - строка документа.
//  ДанныеВида - Структура - реквизиты вида цен (см. ОбщегоНазначенияВызовСервераПовтИсп.ДанныеВидаЦены).
//  ДанныеЦен - Структура, Неопределено - заготовленные базы (см. ДанныеЦенДляСписка).
//
// Возвращаемое значение:
//  Массив - пустой или с одной структурой: Цена, Упаковка.
//
Функция ДинамическаяЦена(Стр, ДанныеВида, ДанныеЦен)
	МасЦены = Новый Массив;
	ДатаЦен = ?(Стр.Свойство("ДатаЦены"), Стр.ДатаЦены, ТекущаяДатаСеанса());
	Если ДанныеВида.ОсноваРасчёта = Перечисления.ОсновыРасчётаНаценок.ПоследнийПриход Тогда
		Если ДанныеЦен = Неопределено Или ДанныеЦен.ПоследнийПриход = Неопределено Тогда
			ТЗБаза = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ДатаЦен, Стр.Номенклатура);
		Иначе
			ТЗБаза = ДанныеЦен.ПоследнийПриход;
		КонецЕсли;
		МасБаза = ТЗБаза.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
	Иначе
		Если ДанныеЦен = Неопределено Или ДанныеЦен.Себестоимость = Неопределено Тогда
			ТЗБаза = РегистрыНакопления.ТоварыВНаличии.ПолучитьСреднююЦенуПоОстаткам(Стр.Номенклатура,
				Стр.Характеристика, ДатаЦен);
		Иначе
			ТЗБаза = ДанныеЦен.Себестоимость;
		КонецЕсли;
		МасБаза = ТЗБаза.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Стр.Номенклатура, Стр.Характеристика));
	КонецЕсли;
	Если МасБаза.Количество() = 0 Или МасБаза[0].Цена = 0 Тогда
		Возврат МасЦены;
	КонецЕсли;
	Цена = ПривестиЦенуКРежимуНДС(МасБаза[0].Цена, Стр.СтавкаНДС, Истина, ДанныеВида.ЦенаВключаетНДС);
	Если ДанныеВида.ВидНаценки = Перечисления.ВидыНаценок.Процент Тогда
		Цена = Цена * (1 + ДанныеВида.Показатель / РаботаСДокументамиКлиентСервер.СтоПроцентов());
	Иначе
		Цена = Цена + ДанныеВида.Показатель;
	КонецЕсли;
	НС = Новый Структура("Цена, Упаковка", Окр(Цена, ДанныеВида.Точность),
		Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	МасЦены.Добавить(НС);
	Возврат МасЦены;
КонецФункции

// Справочные цены строки (розничная, минимальная, по типу цен): из прайса, а для видов цен
// с динамическим расчётом - от базы вида; без учёта режима НДС документа.
//
// Параметры:
//  Стр - Структура - строка документа со свойствами ЦенаРозничная, ЦенаМинимальная, ЦенаПоТипуЦен (любое может отсутствовать).
//  ДанныеЦен - Структура, Неопределено - заготовленные базы динамического расчёта (см. ДанныеЦенДляСписка).
//
Процедура ЗаполнитьСправочныеЦены(Стр, ДанныеЦен = Неопределено)
	Если Не Стр.Свойство("ЦенаРозничная") И Не Стр.Свойство("ЦенаМинимальная") И Не Стр.Свойство("ЦенаПоТипуЦен") Тогда
		Возврат;
	КонецЕсли;
	ВидЦеныРозничная = Справочники.ВидыЦен.Розничная;
	ВидЦеныМинимальная = Справочники.ВидыЦен.МинимальнаяЦенаПродажи;
	МасВидыЦен = Новый Массив;
	МасВидыЦен.Добавить(ВидЦеныРозничная);
	МасВидыЦен.Добавить(ВидЦеныМинимальная);
	Если Стр.Свойство("ТипЦеныПоТипуЦен") Тогда
		МасВидыЦен.Добавить(Стр.ТипЦеныПоТипуЦен);
	КонецЕсли;
	ТЗПоследнийПрайс = РегистрыСведений.ЦеныНоменклатуры.ПоследнийПрайс(Стр.ДатаЦены, МасВидыЦен);
	ЗаполнитьСправочнуюЦену(Стр, "ЦенаРозничная", ТЗПоследнийПрайс, ВидЦеныРозничная, ДанныеЦен);
	ЗаполнитьСправочнуюЦену(Стр, "ЦенаМинимальная", ТЗПоследнийПрайс, ВидЦеныМинимальная, ДанныеЦен);
	Если Стр.Свойство("ТипЦеныПоТипуЦен") Тогда
		ЗаполнитьСправочнуюЦену(Стр, "ЦенаПоТипуЦен", ТЗПоследнийПрайс, Стр.ТипЦеныПоТипуЦен, ДанныеЦен);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСправочнуюЦену(Стр, ИмяСвойства, ТЗПоследнийПрайс, ВидЦены, ДанныеЦен)
	// Одна справочная цена строки: срез прайса по виду цен, а для динамического вида - расчёт от базы.
	Если Не Стр.Свойство(ИмяСвойства) Тогда
		Возврат;
	КонецЕсли;
	Стр[ИмяСвойства] = 0;
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат;
	КонецЕсли;
	ДанныеВида = ОбщегоНазначенияВызовСервераПовтИсп.ДанныеВидаЦены(ВидЦены);
	Если ДанныеВида.ДинамическийРасчет Тогда
		МасЦены = ДинамическаяЦена(Стр, ДанныеВида, ДанныеЦен);
	Иначе
		Отбор = Новый Структура("Номенклатура, Характеристика, ВидЦены", Стр.Номенклатура, Стр.Характеристика, ВидЦены);
		МасЦены = ТЗПоследнийПрайс.НайтиСтроки(Отбор);
	КонецЕсли;
	Если МасЦены.Количество() > 0 Тогда
		Стр[ИмяСвойства] = МасЦены[0].Цена;
	КонецЕсли;
КонецПроцедуры

// Приводит цену к режиму НДС документа: добавляет НДС сверху или выделяет его из цены.
//
// Параметры:
//  Цена - Число - цена в режиме прайса.
//  СтавкаНДС - СправочникСсылка.СтавкиНДС - ставка НДС номенклатуры.
//  ЦенаСНДС - Булево - цена прайса включает НДС.
//  НужнаЦенаСНДС - Булево - режим НДС документа.
//
// Возвращаемое значение:
//  Число - цена в режиме документа.
//
Функция ПривестиЦенуКРежимуНДС(Цена, СтавкаНДС, ЦенаСНДС, НужнаЦенаСНДС) Экспорт
	Если ЦенаСНДС = НужнаЦенаСНДС Тогда
		Возврат Цена;
	КонецЕсли;
	Если ЦенаСНДС Тогда
		Возврат Цена - РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(СтавкаНДС, Цена, Истина);
	КонецЕсли;
	Возврат Цена + РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(СтавкаНДС, Цена, Ложь);
КонецФункции

// Режим НДС вида цен: Истина, если цены вида включают НДС (для пустого вида цен - Истина).
//
// Параметры:
//  ВидЦены - СправочникСсылка.ВидыЦен
//
// Возвращаемое значение:
//  Булево
//
Функция ЦенаВключаетНДСПоВидуЦен(ВидЦены) Экспорт
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЦены, "ЦенаВключаетНДС") = Истина;
КонецФункции

Функция ПолучитьСтатьюДДСПоХозяйственнойОперации(ХозяйственнаяОперация) Экспорт
	Мас = Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьПоХозяйственнойОперации(ХозяйственнаяОперация);
	Возврат ?(Мас.Количество() = 0, Неопределено, Мас[0]);	
КонецФункции

Функция ПолучитьНоменклатуруПоШтрихкоду(Штрихкод, ЕстьСерия = Истина) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	                      |	ШтрихкодыНоменклатуры.Серия КАК Серия
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		ТЗ = Рез.Выгрузить();
		Структура = Новый Структура("Номенклатура,Характеристика");
		Если ЕстьСерия Тогда 
			Структура.Вставить("Серия");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Структура,ТЗ[0]);
		Возврат Структура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции
	
#КонецОбласти

#Область Отчёты

Функция УстановитьНастройкиОтчёта(ТипОтчета, СтруктураПараметры, СтруктураОтбор) Экспорт
    ОтчетОбъект = Отчеты[ТипОтчета].Создать();    
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
    Настройки = КомпоновщикНастроек.Настройки;
	ПользовательскиеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки;
	// Параметры
	Для Каждого Эл Из СтруктураПараметры Цикл
        Для Каждого ПараметрСКД Из ПользовательскиеНастройки.Элементы Цикл
            Если ТипЗнч(ПараметрСКД) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда Продолжить КонецЕсли;  
            Если Строка(ПараметрСКД.Параметр) <> Эл.Ключ Тогда Продолжить КонецЕсли; 
            ПараметрСКД.Значение = Эл.Значение;
            ПараметрСКД.Использование = Истина;
        КонецЦикла;    
	КонецЦикла;
	// Отбор
	Для Каждого Эл Из СтруктураОтбор Цикл        
       	Отбор = Новый ПолеКомпоновкиДанных(Эл.Ключ);
		Для Каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл
			Если ЭлементНастройки.ЛевоеЗначение <> Отбор Тогда Продолжить КонецЕсли; 
			Если ТипЗнч(Эл.Значение) = Тип("Массив") Тогда
				СЗ = Новый СписокЗначений;
				СЗ.ЗагрузитьЗначения(Эл.Значение);
				ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				ЭлементНастройки.ПравоеЗначение = СЗ; 
			Иначе
				ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементНастройки.ПравоеЗначение = Эл.Значение;	
			КонецЕсли;			
			ЭлементНастройки.Использование = Истина;
			Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
				ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
				Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
					ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения;
					ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение;
					ПользовательскийПараметр.Использование = ЭлементНастройки.Использование;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;        
	КонецЦикла;
    Возврат ПользовательскиеНастройки;
КонецФункции

#КонецОбласти

#Область Проверки

Функция ДоступРазрешён() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Структура;
	Результат.Вставить("ДоступРазрешён", ?(ЗначениеЗаполнено(ПараметрыСеанса.Пользователь), Истина, РольДоступна(Метаданные.Роли.Администратор)));
	Результат.Вставить("ЭтоВнешнийПользователь", Ложь);	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Разное

Функция РассчитатьКоэффициентЕдиницы(Единица, ЕдиницаПреобразования = Неопределено) Экспорт
	Коэффициент = 1;
	//Если ЗначениеЗаполнено(Единица) Тогда
	//	Коэффициент = Единица.Числитель / Единица.Знаменатель;
	//	Если ЗначениеЗаполнено(ЕдиницаПреобразования) Тогда
	//		Если Единица.ТипИзмеряемойВеличины = ЕдиницаПреобразования.ТипИзмеряемойВеличины Тогда
	//			Коэффициент = Коэффициент / (ЕдиницаПреобразования.Числитель / ЕдиницаПреобразования.Знаменатель);
	//		ИначеЕсли Единица.ТипИзмеряемойВеличины <> Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда
	//			ВызватьИсключение("При расчёте коэффициента не совпали типы измеряемых величин");
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЕсли;	
	Возврат Коэффициент;
КонецФункции

Процедура УстановкаПараметровСеансаКлиентаНаСервере(Параметры) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированнаяСтруктура(Параметры);	
КонецПроцедуры	

Функция ПолучитьСтильПодсветкиСлов() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ШрифтПосветки", ШрифтыСтиля.Шрифт_Подвал);
	Результат.Вставить("ЦветПосветки", ЦветаСтиля.Цвет_Зелёный);
	Результат.Вставить("ЦветПосветкиНеактивнойСтроки", ЦветаСтиля.Цвет_ПоясняющийТекст);
	Возврат Результат;
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции 

// Возвращает значения нескольких реквизитов объекта одним обращением к базе.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, реквизиты которого нужны.
//  Реквизиты - Строка - имена реквизитов через запятую, например "Артикул,Описание".
//
// Возвращаемое значение:
//  Структура - ключи: имена реквизитов, значения: значения реквизитов
//              (см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта).
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
КонецФункции

// Процедура, определяет структурную единицу, под которым запущен сеанс и пытается
// найти соответсвие ему в справочнике "СтруктурныеЕдиницы". Параметр сеанса ТекущийЦентрКрасоты
// устанавливается как ссылка на найденный (созданный) элемент справочника.
//
Функция ОпределитьТекущееРазрешениеЭкрана() Экспорт
	
	ПОПЫТКА
		ComОбъект = Новый COMОбъект("Helix");
		РазрешениеЭкрана = ComОбъект.ОпределитьРазрешение();
	Исключение
	КонецПопытки;	
	
	Возврат ?(ЗначениеЗаполнено(РазрешениеЭкрана), РазрешениеЭкрана, "1024*786");
	
КонецФункции

Функция ПолучитьИмяПринтераЧековНаСервере() Экспорт 
	Возврат РегистрыСведений.НастройкиПользователей.ПринтерЧеков();
КонецФункции

Функция ПолучитьЗаголовокСистемы() Экспорт
	Возврат Константы.ЗаголовокСистемы.Получить();
КонецФункции

Процедура НастроитьПанели() Экспорт
	Если Не РольДоступна("ЛичныйКабинет") Тогда 
		Возврат;
	КонецЕсли;

	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	
	// С помощью пустого объекта настроек получить настройки состава, установленные в конфигураторе.
	//НастройкиСостава = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиСоставаИнтерфейсаКлиентскогоПриложения");
	//Если НастройкиСостава = Неопределено Тогда 
		НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
	//КонецЕсли;
	
	// Очистить настройки состава.
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Низ.Очистить();
	НастройкиСостава.Право.Очистить();
	
	// Загрузить настройки состава в пустой объект настроек.
	НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	
	// Положить объект настроек текущему пользователю в хранилище.
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
КонецПроцедуры

#КонецОбласти
